.setcpu		"6502"
.autoimport	on

; iNESヘッダ "HEADER"はcfgのSEGMENTSで定義
.segment "HEADER"
	.byte	$4E, $45, $53, $1A	; "NES" Header
	.byte	$02			; PRG-BANKS
	.byte	$01			; CHR-BANKS
	.byte	$01			; Vetrical Mirror
	.byte	$00			; 
	.byte	$00, $00, $00, $00	; 
	.byte	$00, $00, $00, $00	; 

.segment "STARTUP" ;  "STARTUP"はcfgのSEGMENTSで定義
; リセット割り込み
.proc	Reset
	sei
	ldx	#$ff
	txs

; スクリーンオフ
	lda	#$00
	sta	$2000 ; 基本設定をクリア
	sta	$2001 ; マスク設定をクリア

; パレットテーブルへ転送(BG用のみ転送)
; VRAM BG用パレット $3F00～$3F0F へ転送を実施
	lda	#$3f ; VRAMアドレス上位1byte
	sta	$2006
	lda	#$00 ; VRAMアドレス下位1byte
	sta	$2006 ; $2006 へ2回 store を行うことでVRAMのアクセス先番地を設定
	ldx	#$00
	ldy	#$10
copypal:
	lda	palettes, x ; palettes + xの値をaへロード
	sta	$2007 ; VRAMへデータ書き込み実行
	inx ; xインクリメント
	dey ; yデクリメント
	bne	copypal ; yデクリメントの結果0にならなかったらcopypalに戻る


; ネームテーブルへ転送(画面の中央付近)
; VRAM ネームテーブル $2000～$23BF 画面0のBG配置パターン
	jsr drawchip

; パレット指定のサンプル
	lda #$23
	sta $2006
	lda #$da
	sta $2006
	lda #%01000000
	sta	$2007
	lda #%11100000
	sta	$2007
	lda #%01000000
	sta	$2007
	lda #%11100000
	sta	$2007

; BGのスクリーン表示位置設定左上にぴったり(スクロール設定)
	lda	#$00
	sta	$2005
	sta	$2005

; スクリーンオン
	lda	#$08 ; 00001000 BGのキャラクタテーブル番号を1に
	sta	$2000
	lda	#$1e ; 00011110 スプライト表示,BG表示,左端8x8のスプライト表示,左端8x8のBG表示
	sta	$2001

; 無限ループ
mainloop:
	jmp	mainloop


; 関数定義テスト
drawchip:
	; 書き込み開始座標指定
	lda	#$20
	sta	$2006
	lda	#$00
	sta	$2006
	
	; ループカウンタ
	ldx #$00
	ldy #$78
maploop:
	; マップ情報を読み込みメモリーに退避
	lda map, x
	sta v_chip
	; サブルーチンでyを書き換えるので、現在のy値をメモリーに退避
	sty v_index
	; v_chipを情報を解析して書き込み
	jsr draw8chip
	; yの値が書き換わっているのでメモリーから復帰
	ldy v_index
	inx
	dey
	bne maploop

	rts

; map情報から画面表示
draw8chip:
	; 1bit単位で0なら通路、1なら壁)
	ldy #$08
loop:
	; map情報の断片をロード
	lda v_chip
	; bit演算した結果を出力BGデータでで 0は空白、1は塗りつぶしのパネルを設定している
	and #$01
	sta $2007
	; 右にビットシフト
	lsr v_chip
	dey
	bne loop
	rts

.endproc

; パレットテーブル
palettes:
	.byte	$0f, $20, $1a, $12
	.byte	$0f, $16, $16, $26
	.byte	$0f, $00, $18, $28
	.byte	$0f, $0a, $10, $2a

; マップ情報
map:
	.byte	%11111111, %11111111, %11111111, %11111111
	.byte	%00000001, %00000000, %00000000, %10000000
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111001, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111001, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111001, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111101, %11111111, %11111111, %11111111

	.byte	%11111101, %11111111, %11111111, %11111111
	.byte	%11111111, %11111111, %11111111, %01111111


; 変数定義方法
.org $0000
v_chip:	.byte	$00	; 処理中のマップ情報
v_index: .byte	$00	; ループカウンタ値保存用
; スタック領域は$0100~$01ff

.segment "VECINFO"
	.word	$0000
	.word	Reset
	.word	$0000

; パターンテーブル
.segment "CHARS"
	.incbin	"downlad.chr"
